// Work №7: Урок 7. ООП Дизайн и Solid ч.2

// 1. Создать проект калькулятора комплексных чисел (достаточно сделать сложение, вычетание(разность), умножение и деление).
// 2. Применить при создании программы архитектурные паттерны, добавить логирование калькулятора.
// 3. Соблюдать принципы SOLID, паттерны проектирования.
// Примечание: Можно выбрать другой язык программирования, например C# или Python, если выбран язык, отличный от JAVA, 
// но тогда необходимо написать документ, каким образом можно запустить приложение (что необходимо установить, каким образом запускать и т.п.).

