// Work №5, Урок 5. От простого к практике

// Взять проект из первого дз и сделать рефакторинг в паттерне MVC

// Work №1:

//     Создать наследника реализованного класса "Горячий Напиток" с дополнительным полем int температура.
//     Создать класс "Горячих Напитков Автомат" реализующий интерфейс "Торговый Автомат" 
//     и реализовать перегруженный метод getProduct(int name, int volume, int temperature),
//     выдающий продукт соответствующий имени, объёму и температуре
//     В main проинициализировать несколько "Горячих Напитков" и "Горячих Напитков Автомат" 
//     и воспроизвести логику, заложенную в программе


public class Main
{
    public static void main(String[] args)
    {
        
    }
}